#--- Apps
cask 'iterm2'
cask 'ghostty'
cask 'spotify'
cask 'zoom'
cask 'rectangle'
cask 'firefox'
cask 'gimp'
cask 'whatsapp'
cask 'scroll-reverser'
cask 'betterdisplay'
cask 'appcleaner'
cask 'steam'
cask 'discord'
cask 'slack'
cask 'audacity'

#--- Passwords
brew 'pass'
brew 'pinentry-mac'
brew 'pwgen'

# After installation, run PREFIX='/opt/homebrew' make hosts-BROWSER-user -f '/opt/homebrew/lib/browserpass/Makefile'
# Then follow the instructions at https://github.com/browserpass/browserpass-legacy#does-not-work-on-macos-native-host-has-exited
# Make sure to update pinentry path in gpg configuration to /opt/homebrew
tap 'amar1729/formulae'
brew 'browserpass'

#--- Development
brew 'node'
brew 'tmux'
brew 'the_silver_searcher'
brew 'neovim'
brew 'z'
brew 'wget'
# Allows using Touch ID for sudo in tmux.
brew 'pam-reattach'
# For flamescope.
brew 'libmagic'
brew 'gh'
brew 'fd'
brew 'jq'

brew 'go'
brew 'clojure'
brew 'leiningen'
brew 'borkdude/brew/clj-kondo'
brew 'elixir'
brew 'ollama'

brew 'uv'
brew 'pg_top'
